# AnalysisDisplayColorSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings Class
Members Example See Also
---
Contains color settings for analysis display style element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AnalysisDisplayColorSettings : IDisposable
```

Visual Basic
---
```text
Public Class AnalysisDisplayColorSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalysisDisplayColorSettings : IDisposable
```

# Examples
CopyC#
```text
AnalysisDisplayColorSettings colorSettings = new AnalysisDisplayColorSettings();
Color orange = new Color(255, 205, 0);
Color purple = new Color(200, 0, 200);
colorSettings.MaxColor = orange;
colorSettings.MinColor = purple;
```

CopyVB.NET
```text
Dim colorSettings As New AnalysisDisplayColorSettings()
Dim orange As New Color(255, 205, 0)
Dim purple As New Color(200, 0, 200)
colorSettings.MaxColor = orange
colorSettings.MinColor = purple
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColorSettings
# See Also
AnalysisDisplayColorSettings Members
Autodesk.Revit.DB.Analysis Namespace